// Detect connection to Feodo Tracker C2 server
let BotnetC2IPBlocklist = externaldata(RemoteIP:string)
[
"https://feodotracker.abuse.ch/downloads/ipblocklist_recommended.txt"
]
with (format="csv")
| where RemoteIP !contains "#";
DeviceNetworkEvents
| where Timestamp >= ago(1h)
| where RemoteIP in (BotnetC2IPBlocklist)
